app/controllers/search_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."collection_id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def toggle_favorite
    @album = Album.find_or_create_by(collection_id: params[:collection_id]) do |album|