app/controllers/search_controller.rb

SELECT "albums"."collection_id" FROM "albums" WHERE "albums"."is_favorite" = ?  [["is_favorite", 1]]
---
  def search
    term = params[:search_term]
    @results = ItunesService.search(term)

    @favorites = Album.where(is_favorite: true).pluck(:collection_id)

INSERT INTO "albums" ("collection_id", "is_favorite", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["collection_id", 376675862], ["is_favorite", 0], ["created_at", "2023-07-28 21:56:45.115616"], ["updated_at", "2023-07-28 21:56:45.115616"]]
SELECT "albums".* FROM "albums" WHERE "albums"."collection_id" = ? LIMIT ?  [["collection_id", 376675862], ["LIMIT", 1]]
UPDATE "albums" SET "is_favorite" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["is_favorite", 1], ["updated_at", "2023-07-28 21:56:45.124447"], ["id", 3]]
---
  def toggle_favorite
    @album = Album.find_or_create_by(collection_id: params[:collection_id]) do |album|
      album.is_favorite = false
    end

    if @album.persisted?
      @album.update(is_favorite: !@album.is_favorite)